app/views/posts/show.html.erb

    <p class="card-text"><%=@post.content%></p>
    <% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 4 ORDER BY `comments`.`id` DESC LIMIT 1

<div class="container">
<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 4