app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`content`, `created_at`, `updated_at`, `post_id`) VALUES ('comment', '2020-03-26 16:00:20.811508', '2020-03-26 16:00:20.811508', 2)
---
    def create
        @post = Post.find(params[:id])
        @post.comments.create(content: params[:content])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 3 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 3
---
    def destroy
        @comment = Comment.find(params[:id])
        @comment.destroy