app/controllers/posts_controller.rb

    def index
        @posts = Post.order(created_at: :desc)
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC

    def create
        @post = Post.new
        @post.title = params[:title]
        @post.content = params[:content]
        @post.save
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('test 2', 'content', '2020-03-26 12:33:21.489480', '2020-03-26 12:33:21.489480')

    def show
        @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` IN (6, NULL)

    def update
        @post = Post.find(params[:id])
        @post.title = params[:post][:title]
        @post.content = params[:post][:content]
        @post.save

        if @post.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'title 55', `posts`.`updated_at` = '2020-03-26 14:23:44.467844' WHERE `posts`.`id` = 5

    def destroy
        @post = Post.find(params[:id])
        @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 5